{
    "version": "https://jsonfeed.org/version/1",
    "title": "Flight Computing",
    "description": "",
    "home_page_url": "https://flightcomp.github.io/website",
    "feed_url": "https://flightcomp.github.io/website/feed.json",
    "user_comment": "",
    "author": {
        "name": "Roberto Chao"
    },
    "items": [
        {
            "id": "https://flightcomp.github.io/website/glide-computers.html",
            "url": "https://flightcomp.github.io/website/glide-computers.html",
            "title": "Wind computing",
            "summary": "One of the main features of today glide computers is the estimation of wind, the speed and direction of the air mass inside we're moving (blue arrow). It's the base of other estimations like the required time and altitude to reach a waypoint. When we sum this vectorial magnitude&hellip;",
            "content_html": "<p class=\"dropcap\">One of the main features of today glide computers is the estimation of wind, the speed and direction of the air mass inside we're moving (blue arrow). It's the base of other estimations like the required time and altitude to reach a waypoint. When we sum this vectorial magnitude to the airspeed (green arrow) we obtain the ground speed measured by the gps of the flight instrument (red arrow).<img class=\"post__image post__image--left\" src=\"https://flightcomp.github.io/website/media/posts/1/Flechas2.png\" alt=\"Vectorial sum\" width=\"192\" height=\"216\"></p>\n<p>So the the procedure to obtain the wind is as simple as substract the air speed to the ground speed given by the gps. Some expensive glide instruments have a true airspeed probe but the vast majority don't. How the latter manage to estimate the wind speed and direction?</p>\n<p>In fact they don't estimate the instant wind speed and direction but an <em>average</em>. They make one more assumption. The airspeed, though unknown, is constant. Making this two assumptions and taking the ground speed measured by the gps in at least three different moments we can pose a resolvable system of equations.</p>\n<p>We don't want to bore you with the mathematical calculations but they are roughly similar to derive the geometric 3D plane from three points it passes through. When we add noise to the position of this three points, just as it happens with the gps data, and the points are near each other, the solution of the system of equations can lead us to a completely different plane. It's what we call an ill-posed problem. To avoid it we must take more than three points and make sure they are far enough from each other.</p>\n<p>In the present case that means taking ground speed samples along a time window sufficiently long and in a wide range of directions of flight. However, if we take a time window too long it won't record variations in the average wind due to changes in the weather conditions or changes of the flight area. A time window of 10 min. is short enough to detect meteorological and geographical changes of wind in the scale of 5 km while still providing a reliable estimate.</p>\n<p>Nevertheless the wind also changes with altitude. Sometimes suddenly when we move from one air layer on to another one. At a climb rate of 2m/s during 10 min we can climb up 1200 m. Enough difference in altitude for the wind average to significantly change two or three times. If we use a 10 min. time window this changes will inadvertently pass because they will be averaged.</p>\n<p>Our algorithm uses a variable lenght time window and records the changes in wind speed and direction with the altitude.</p>\n<p> </p>",
            "image": "https://flightcomp.github.io/website/media/posts/1/IMG-20170720-WA0007.jpg",
            "author": {
                "name": "Roberto Chao"
            },
            "tags": [
            ],
            "date_published": "2020-04-07T16:38:47+02:00",
            "date_modified": "2020-04-08T19:44:39+02:00"
        }
    ]
}
